Revit 2027 API
HardwoodApplicationType Enumeration
 The enumerated type representing the permitted values for the asset property "HardwoodApplication" from the "Hardwood" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum HardwoodApplicationType
Public Enumeration HardwoodApplicationType
public enum class HardwoodApplicationType
type HardwoodApplicationType
Members
Member name | Value | Description
looring | 0
urniture | 1
See Also
Reference
Autodesk.Revit.DB.Visual Namespace